---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin
source: html/a2155489-a4ba-ce23-06b6-872e1a59547b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin Property

The Floor or Roof or Toposolid is too thin for its given type.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeFailedTooThin { get; }
```